def main():
    arr = None
    n_rows = n_cols = 0

    while True:
        print("""
            Меню программы:
            1. Ввод размера массива
            2. Создание массива
            3. Просмотр созданного массива
            4. Выполнение функций
            5. Выход
        """)
        choice = input("Выберите пункт меню: ")

        match choice:
            case '1':
                print("Вводразмерамассива...")
                try:
                    n_rows = int(input('Введите количество строк: '))
                    n_cols = int(input('Введите количество столбцов: '))
                    print(f'Установлен размер {n_rows}*{n_cols}')
                except ValueError:
                    print('Ошибка! Введитечисла')

            case '2':
                print("Создание массива...")
                arr = creat_array(n_rows, n_cols)

            case '3':
                print("Просмотр массива...")
                if arr is None:
                    print('Ошибка! Массив ещё не создан.')
                else:
                    for x in arr:
                        print(x)
            case '4':
                if arr is None:
                    print('Ошибка! Сначала создайте массив.')
                    continue
                else:
                    print("""Выполнениефункций...

                        Выберите функцию:
                        1 Напечатать индексы отрицательных элементов массива
                        2 Вывести на экран элементы массива, кратные 5, и их индексы
                        3 Вычислить сумму элементов каждого столбца и строки
                        4 Найти сумму всех четных элементов двумерного массива целых чисел
                        5 Поэлементно вычесть последнюю строку из всех строк, кроме последней
                        0 Назад""")
                func_choice = input('Введите номер функции: ')

                match func_choice:
                    case '1':
                        print('Заменить все элементы массива их квадратами...')
                        square_index(arr)
                        print('Готово!')
                    case '2':
                        print('Найти строку с наибольшей суммой элементов...')
                        max_sumstr(arr)
                        print('Готово!')
                    case '3':
                        print('Вычислить сумму элементов, расположенных на главной диагонали массива...')
                        sum_of_main_diag(arr)
                        print('Готово!')
                    case '4':
                        print('Найти номер строки и столбца максимального элемента массива...')
                        index_of_max(arr)
                        print('Готово!')
                    case '5':
                        print('Сумма положительных элементов всех ненулевых строк массива...')
                        not_zero_str_sum(arr)
                        print('Готово!')
                    case '0':
                        continue
                    case _:
                        print('Ошибка! Введите число от 0 до 5.')

            case  '5':
                print("Выход из программы.")
                arr = None
                break
            case _:
                print("Неверный пункт меню, попробуйте снова.")
main()

